Revit 2027 API
AnalyticalPowerDistributableNodeData.GetDemandPerPhaseResults Method
 Get an ElectricalPerPhaseData which contains each electrical phase's demand load and demand current of the power distributable node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalPerPhaseData GetDemandPerPhaseResults()
Public Function GetDemandPerPhaseResults As ElectricalPerPhaseData
public:
ElectricalPerPhaseData^ GetDemandPerPhaseResults()
member GetDemandPerPhaseResults : unit -> ElectricalPerPhaseData
Return Value
ElectricalPerPhaseData
See Also
Reference
AnalyticalPowerDistributableNodeData Class
Autodesk.Revit.DB.Electrical Namespace